app/views/users/show.html.erb

  <div class="span8">
     <% if @user.events.any? %>
---
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 1