app/views/shared/_user_info.html.erb

<span>
  (<%= pluralize(current_user.events.count, "event") %>)
---
SELECT "events".* FROM "events" ORDER BY events.created_at DESC
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 10