app/controllers/events_controller.rb

    def create
        this_time = Time.parse(params["hour"] + ":" + params["minute"] + " " + params["meridian"], Time.now)
        @event = current_user.events.build(activity:params["event-activity"], location:params["event-location"], start_time:this_time)
        if @event.save
---
INSERT INTO "events" ("activity", "created_at", "location", "start_time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["activity", nil], ["created_at", Mon, 20 May 2013 03:30:16 UTC +00:00], ["location", nil], ["start_time", nil], ["updated_at", Mon, 20 May 2013 03:30:16 UTC +00:00], ["user_id", 10]]