app/controllers/static_pages_controller.rb

  def home
    if !current_user.nil?
      @event = current_user.events.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 10 ORDER BY events.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 10