app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @events = @user.events.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = 1 ORDER BY events.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "events" WHERE "events"."user_id" = 1